Revit 2024 API
ExportPDFSettings.FindByName Method
 Returns settings element by name.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public static ExportPDFSettings FindByName(
	Document document,
	string name
)
Visual Basic
Public Shared Function FindByName ( _
	document As Document, _
	name As String _
) As ExportPDFSettings
Visual C++
public:
static ExportPDFSettings^ FindByName(
	Document^ document,
	String^ name
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document to find the settings with the specified name.
name
Type: System.String
 Name of the settings to find.
Return Value
 The settings element, or null if not found.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ExportPDFSettings Class
Autodesk.Revit.DB Namespace